---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.RegenFailures.RegenElements
source: html/d7d87dfb-f881-0180-8adc-b5e4674c7364.htm
---
# Autodesk.Revit.DB.BuiltInFailures.RegenFailures.RegenElements Property

Regenerating elements.

## Syntax (C#)
```csharp
public static FailureDefinitionId RegenElements { get; }
```